app/Controllers/Dashboard.php

    public function index()
    {

        if (!session()->get('logged_in')) {
            return redirect()->to('/login')->with('error', 'You need to login first.');
        }

        $announcementModel = new AnnouncementModel();
        $employeeModel = new EmployeeModel();
        $attendanceModel = new AttendanceModel();
        $orderModel = new OrderSummaryModel();
        $performanceModel = new PerformanceModel();
        $manpowerModel = new ManpowerModel();

        $data = [
            'announcements' => $announcementModel->findAll(),
            'employees' => $employeeModel->findAll(),
            'attendance' => $attendanceModel->findAll(),
            'orders' => $orderModel->findAll(),
            'performance' => $performanceModel->findAll(),
            'manpower' => $manpowerModel->findAll(),
        ];
---
SELECT *
FROM `announcements`
SELECT *
FROM `employees`
SELECT *
FROM `attendance`
SELECT *
FROM `order_summary`
SELECT *
FROM `performance`
SELECT *
FROM `manpower`