app/Controllers/Defects.php

    public function index()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/login')->with('error', 'You need to login first.');
        }

        $db = \Config\Database::connect();
        $setting = $db->table('global_settings')->where('id', 1)->get()->getRow();

        $data['category_toggle'] = $setting->category_toggle ?? 0;

        $model = new DefectsModel();
        $data = [
            'defects' => $model
                ->select('id,id_shift, name, defect_type, SUM(count) as total')
                ->groupBy('defect_date, defect_type')
                ->orderBy('defect_date', 'DESC') // Show newest defects first
                ->findAll(),
            'title' => 'Defect information',
            'category_toggle' => $setting->category_toggle ?? 0,
        ];
---
SELECT `name`, `defect_date`, `defect_type`, SUM(count) as total
FROM `defects`
GROUP BY `defect_date`, `defect_type`, `name`
ORDER BY `defect_date` DESC

    public function deleteZeroCountDefects()
    {
        // Assuming you are using a model called `DefectsModel`
        $defectModel = new DefectsModel();

        // Delete defects where count = 0
        $defectModel->where('count', 0)->delete();
---
DELETE FROM `defects`
WHERE `count` = 0