app/Controllers/empSkills.php

SELECT `title`
FROM `title`
 LIMIT 1
---
    public function getTitle()
    {
        $model = new EmployeeSkillsModel();
        $titleData = $model->select('title')->first();