app/Models/Dailyattendancem.php

    public function getAllAttendance()
    {
        return $this->findAll();
---
SELECT *
FROM `daily_attendance`
ORDER BY `updated_at` DESC