app/Models/defectsTypesM.php

SELECT `id`, `type`
FROM `defects_type`
---
    public function getDefectTypes()
    {
        return $this->select('id, type')->findAll(); // Fetch id and defect_type columns