app/Models/EmployeeSkillsModel.php

SELECT *
FROM `title2`
 LIMIT 1
---
    public function getTitleFromTitle2()
    {
        return $this->db->table('title2')->limit(1)->get()->getRow(); // Fetching the first row