app/Models/Empusersm.php

    public function verifyUser($employee_id, $password)
    {
        $hashed_password = md5($password); // Hash the input password before checking

        return $this->where('employee_id', $employee_id)
                    ->where('password', $hashed_password)
                    ->first();
---
SELECT *
FROM `users`
WHERE `employee_id` = '2501-030'
AND `password` = '552d05ad6f88813684ccb5f6f2b4fa5a'
 LIMIT 1