Models/fetchShiftm.php

SELECT *
FROM `shift`
---
    public function getAllShiftTypes()
    {
        // Fetch all shift types from the shift table
        return $this->findAll(); // You can customize this if you want specific fields or conditions